11/data/attachments/8c52f8d32cabd8f7.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Joseph_positive_Friend_4053_3</nif:username>
            <nif:friendToBeRequested>soap_friends_d68ab28d-3076-45c5-9efc-575aac863dcc</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>